In [2]:
%load_ext sql

In [3]:
%sql sqlite:///publications.db

In [4]:
%%sql
select name
from sqlite_master
where type='table'
order by name;

 * sqlite:///publications.db
Done.

[('authors',),
 ('discounts',),
 ('employee',),
 ('jobs',),
 ('pub_info',),
 ('publishers',),
 ('roysched',),
 ('sales',),
 ('stores',),
 ('titleauthor',),
 ('titles',)]

In [5]:
%%sql
select *
from authors
limit 5

 * sqlite:///publications.db
Done.

[('172-32-1176', 'White', 'Johnson', '408 496-7223', '10932 Bigge Rd.', 'Menlo Park', 'CA', '94025', 1),
 ('213-46-8915', 'Green', 'Marjorie', '415 986-7020', '309 63rd St. #411', 'Oakland', 'CA', '94618', 1),
 ('238-95-7766', 'Carson', 'Cheryl', '415 548-7723', '589 Darwin Ln.', 'Berkeley', 'CA', '94705', 1),
 ('267-41-2394', "O'Leary", 'Michael', '408 286-2428', '22 Cleveland Av. #14', 'San Jose', 'CA', '95128', 1),
 ('274-80-9391', 'Straight', 'Dean', '415 834-2919', '5420 College Av.', 'Oakland', 'CA', '94609', 1)]

In [6]:
%%sql
select *
from titles
limit 5

 * sqlite:///publications.db
Done.

[('BU1032', "The Busy Executive's Database Guide", 'business', '1389', 19.99, 5000, 10, 4095, 'An overview of available database systems with emphasis on common business applications. Illustrated.', '1991-06-12 00:00:00'),
 ('BU1111', 'Cooking with Computers: Surreptitious Balance Sheets', 'business', '1389', 11.95, 5000, 10, 3876, 'Helpful hints on how to use your electronic resources to the best advantage.', '1991-06-09 00:00:00'),
 ('BU2075', 'You Can Combat Computer Stress!', 'business', '0736', 2.99, 10125, 24, 18722, 'The latest medical and psychological techniques for living with the electronic office. Easy-to-understand explanations.', '1991-06-30 00:00:00'),
 ('BU7832', 'Straight Talk About Computers', 'business', '1389', 19.99, 5000, 10, 4095, 'Annotated analysis of what computers can do for you: a no-hype guide for the critical user.', '1991-06-22 00:00:00'),
 ('MC2222', 'Silicon Valley Gastronomic Treats', 'mod_cook', '0877', 19.99, 0, 12, 2032, 'Favorite recipes for quick, easy, and elegant meals.', '1991-06-09 00:00:00')]

In [7]:
%%sql
select *
from titleauthor
order by title_id
limit 10

 * sqlite:///publications.db
Done.

[('213-46-8915', 'BU1032', 2, 40),
 ('409-56-7008', 'BU1032', 1, 60),
 ('267-41-2394', 'BU1111', 2, 40),
 ('724-80-9391', 'BU1111', 1, 60),
 ('213-46-8915', 'BU2075', 1, 100),
 ('274-80-9391', 'BU7832', 1, 100),
 ('712-45-1867', 'MC2222', 1, 100),
 ('722-51-5454', 'MC3021', 1, 75),
 ('899-46-2035', 'MC3021', 2, 25),
 ('238-95-7766', 'PC1035', 1, 100)]

In [8]:
%%sql
select *
from titleauthor
order by au_id
limit 10

 * sqlite:///publications.db
Done.

[('172-32-1176', 'PS3333', 1, 100),
 ('213-46-8915', 'BU1032', 2, 40),
 ('213-46-8915', 'BU2075', 1, 100),
 ('238-95-7766', 'PC1035', 1, 100),
 ('267-41-2394', 'BU1111', 2, 40),
 ('267-41-2394', 'TC7777', 2, 30),
 ('274-80-9391', 'BU7832', 1, 100),
 ('409-56-7008', 'BU1032', 1, 60),
 ('427-17-2319', 'PC8888', 1, 50),
 ('472-27-2349', 'TC7777', 3, 30)]

## Challenge 1

In [35]:
%%sql
select au.au_id as AUTHOR_ID ID, au.au_lname as LAST_NAME, au.au_fname as FIRST_NAME, tls.title as TITLE, pubs.pub_name as PUBLISHER 
from authors au
join titleauthor ta ON au.au_id=ta.au_id
join titles tls ON ta.title_id = tls.title_id  
join publishers pubs ON tls.pub_id = pubs.pub_id
join publishers AS totalpubs ON tls.pub_id = totalpubs.pub_id
group by totalpubs

 * sqlite:///publications.db
(sqlite3.OperationalError) near "ID": syntax error
[SQL: select au.au_id as AUTHOR_ID ID, au.au_lname as LAST_NAME, au.au_fname as FIRST_NAME, tls.title as TITLE, pubs.pub_name as PUBLISHER
from authors au
join titleauthor ta ON au.au_id=ta.au_id
join titles tls ON ta.title_id = tls.title_id
join publishers pubs ON tls.pub_id = pubs.pub_id
join publishers AS totalpubs ON tls.pub_id = totalpubs.pub_id
group by totalpubs]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [34]:
%%sql
select count (*)
FROM authors au
join titleauthor ta ON au.au_id=ta.au_id
join titles tls ON ta.title_id = tls.title_id  
join publishers pubs ON tls.pub_id = pubs.pub_id

 * sqlite:///publications.db
Done.

[(25,)]

## Challenge 2

In [33]:
%%sql
select pubs.pub_name, titles.title_id, count (*) as 'TITLE COUNT'
from publishers pubs
join titles titles
on pubs.pub_id = titles.pub_id
group by 'AUTHOR ID'

 * sqlite:///publications.db
Done.

[('Algodata Infosystems', 'BU1032', 18)]

In [32]:
%%sql
select au.au_id as 'AUTHOR ID', au.au_lname as 'LAST NAME', au.au_fname as 'FIRST NAME', pubs.pub_name as 'PUBLISHER', COUNT(*) as 'TITLE COUNT' 
from authors au
join titleauthor ta ON au.au_id=ta.au_id
join titles tls ON ta.title_id = tls.title_id  
join publishers pubs ON tls.pub_id = pubs.pub_id
group by tls.title

 * sqlite:///publications.db
Done.

[('238-95-7766', 'Carson', 'Cheryl', 'Algodata Infosystems', 1),
 ('724-80-9391', 'MacFeather', 'Stearns', 'Binnet & Hardley', 2),
 ('267-41-2394', "O'Leary", 'Michael', 'Algodata Infosystems', 2),
 ('486-29-1786', 'Locksley', 'Charlene', 'New Moon Books', 1),
 ('648-92-1872', 'Blotchet-Halls', 'Reginald', 'Binnet & Hardley', 1),
 ('899-46-2035', 'Ringer', 'Anne', 'New Moon Books', 2),
 ('998-72-3567', 'Ringer', 'Albert', 'New Moon Books', 1),
 ('486-29-1786', 'Locksley', 'Charlene', 'Algodata Infosystems', 1),
 ('807-91-6654', 'Panteley', 'Sylvia', 'Binnet & Hardley', 1),
 ('172-32-1176', 'White', 'Johnson', 'New Moon Books', 1),
 ('427-17-2319', 'Dull', 'Ann', 'Algodata Infosystems', 2),
 ('712-45-1867', 'del Castillo', 'Innes', 'Binnet & Hardley', 1),
 ('274-80-9391', 'Straight', 'Dean', 'Algodata Infosystems', 1),
 ('267-41-2394', "O'Leary", 'Michael', 'Binnet & Hardley', 3),
 ('213-46-8915', 'Green', 'Marjorie', 'Algodata Infosystems', 2),
 ('722-51-5454', 'DeFrance', 'Michel', 'Binnet & Hardley', 2),
 ('213-46-8915', 'Green', 'Marjorie', 'New Moon Books', 1)]

In [74]:
%%sql
select au.au_id as 'AUTHOR ID', au.au_lname as 'LAST NAME', au.au_fname as 'FIRST NAME', SUM(sls.qty) as 'TOTAL' 
from authors au
join titleauthor ta ON au.au_id = ta.au_id
join titles tls ON ta.title_id = tls.title_id  
join sales sls ON tls.title_id = sls.title_id
group by au.au_id
order by total desc
Limit 3

 * sqlite:///publications.db
Done.

[('899-46-2035', 'Ringer', 'Anne', 148),
 ('998-72-3567', 'Ringer', 'Albert', 133),
 ('213-46-8915', 'Green', 'Marjorie', 50)]

## 4

In [73]:
%%sql
select au.au_id as 'AUTHOR ID', au.au_lname as 'LAST NAME', au.au_fname as 'FIRST NAME', SUM(sls.qty) as 'TOTAL' 
from authors au
join titleauthor ta on au.au_id=ta.au_id
join titles tls on ta.title_id = tls.title_id  
join sales sls on tls.title_id = sls.title_id 
group by au.au_id
order by total desc
Limit 3

 * sqlite:///publications.db
Done.

[('899-46-2035', 'Ringer', 'Anne', 148),
 ('998-72-3567', 'Ringer', 'Albert', 133),
 ('213-46-8915', 'Green', 'Marjorie', 50)]

In [77]:
%%sql
select au.au_id as 'AUTHOR ID', au.au_lname as 'LAST NAME', au.au_fname as 'FIRST NAME', ifnull(sum(sls.qty), 0) as 'TOTAL'
from authors au
join 
    titleauthor ta ON au.au_id=ta.au_id
join
    titles tls ON ta.title_id = tls.title_id  
join
    sales sls ON tls.title_id = sls.title_id
      
group by au.au_id
order by total desc

 * sqlite:///publications.db
Done.

[('899-46-2035', 'Ringer', 'Anne', 148),
 ('998-72-3567', 'Ringer', 'Albert', 133),
 ('213-46-8915', 'Green', 'Marjorie', 50),
 ('427-17-2319', 'Dull', 'Ann', 50),
 ('846-92-7186', 'Hunter', 'Sheryl', 50),
 ('267-41-2394', "O'Leary", 'Michael', 45),
 ('724-80-9391', 'MacFeather', 'Stearns', 45),
 ('722-51-5454', 'DeFrance', 'Michel', 40),
 ('807-91-6654', 'Panteley', 'Sylvia', 40),
 ('238-95-7766', 'Carson', 'Cheryl', 30),
 ('486-29-1786', 'Locksley', 'Charlene', 25),
 ('472-27-2349', 'Gringlesby', 'Burt', 20),
 ('648-92-1872', 'Blotchet-Halls', 'Reginald', 20),
 ('672-71-3249', 'Yokomoto', 'Akiko', 20),
 ('756-30-7391', 'Karsen', 'Livia', 20),
 ('172-32-1176', 'White', 'Johnson', 15),
 ('274-80-9391', 'Straight', 'Dean', 15),
 ('409-56-7008', 'Bennet', 'Abraham', 15),
 ('712-45-1867', 'del Castillo', 'Innes', 10)]